In [2]:
import pandas as pd
import numpy as np

In [3]:
inventory = pd.read_csv('inventory.csv')
products = pd.read_csv('products.csv')
sales = pd.read_csv('sales.csv')
stores = pd.read_csv('stores.csv')

# Inventory

In [14]:
inventory.head()

   Store_ID  Product_ID  Stock_On_Hand
0         1           1             27
1         1           2              0
2         1           3             32
3         1           4              6
4         1           5              0

In [15]:
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1593 entries, 0 to 1592
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Store_ID       1593 non-null   int64
 1   Product_ID     1593 non-null   int64
 2   Stock_On_Hand  1593 non-null   int64
dtypes: int64(3)
memory usage: 37.5 KB

In [16]:
inventory.describe()

          Store_ID   Product_ID  Stock_On_Hand
count  1593.000000  1593.000000    1593.000000
mean     25.326428    18.073446      18.670433
std      14.477592    10.064254      18.997652
min       1.000000     1.000000       0.000000
25%      13.000000     9.000000       6.000000
50%      25.000000    18.000000      13.000000
75%      38.000000    27.000000      24.000000
max      50.000000    35.000000     139.000000

Nota: Bajar nombre

# Products

In [23]:
products.head()

   Product_ID      Product_Name Product_Category Product_Cost Product_Price
0           1     Action Figure             Toys       $9.99        $15.99
1           2    Animal Figures             Toys       $9.99        $12.99
2           3   Barrel O' Slime     Art & Crafts       $1.99         $3.99
3           4  Chutes & Ladders            Games       $9.99        $12.99
4           5  Classic Dominoes            Games       $7.99         $9.99

In [24]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Product_ID        35 non-null     int64
 1   Product_Name      35 non-null     object
 2   Product_Category  35 non-null     object
 3   Product_Cost      35 non-null     object
 4   Product_Price     35 non-null     object
dtypes: int64(1), object(4)
memory usage: 1.5+ KB

In [25]:
products.describe(include=object)

         Product_Name Product_Category Product_Cost Product_Price
count              35               35           35            35
unique             35                5           16            18
top     Action Figure             Toys       $3.99        $19.99
freq                1                9            5             5

Nota: bajar nombre, cambiar tipo costo y precio

In [22]:
# Validate referential integrity against parent tables
invalid_stores = set(inventory['Store_ID']) - set(stores['Store_ID'])
invalid_products = set(inventory['Product_ID']) - set(products['Product_ID'])
print(f"\nInvalid Store_IDs: {len(invalid_stores)}")
print(f"Invalid Product_IDs: {len(invalid_products)}")

Invalid Store_IDs: 0
Invalid Product_IDs: 0

Negative stock: 0

In [21]:
stores.head()

,Store_ID,Store_Name,Store_City,Store_Location,Store_Open_Date
0,1,Maven Toys Guadalajara 1,Guadalajara,Residential,1992-09-18
1,2,Maven Toys Monterrey 1,Monterrey,Residential,1995-04-27
2,3,Maven Toys Guadalajara 2,Guadalajara,Commercial,1999-12-27
3,4,Maven Toys Saltillo 1,Saltillo,Downtown,2000-01-01
4,5,Maven Toys La Paz 1,La Paz,Downtown,2001-05-31

In [27]:
stores.describe(include=object)

                      Store_Name   Store_City Store_Location Store_Open_Date
count                         50           50             50              50
unique                        50           29              4              50
top     Maven Toys Guadalajara 1  Guadalajara       Downtown      1992-09-18
freq                           1            4             29               1

Nota: bajar nombre, cambiar tipo store open date

# Sales

In [28]:
sales.head()

   Sale_ID        Date  Store_ID  Product_ID  Units
0        1  2022-01-01        24           4      1
1        2  2022-01-01        28           1      1
2        3  2022-01-01         6           8      1
3        4  2022-01-01        48           7      1
4        5  2022-01-01        44          18      1

In [29]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 829262 entries, 0 to 829261
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Sale_ID     829262 non-null  int64
 1   Date        829262 non-null  object
 2   Store_ID    829262 non-null  int64
 3   Product_ID  829262 non-null  int64
 4   Units       829262 non-null  int64
dtypes: int64(4), object(1)
memory usage: 31.6+ MB

In [30]:
sales.describe()

             Sale_ID       Store_ID     Product_ID          Units
count  829262.000000  829262.000000  829262.000000  829262.000000
mean   414631.500000      25.277034      15.014149       1.315103
std    239387.463802      14.352573       9.869417       0.830701
min         1.000000       1.000000       1.000000       1.000000
25%    207316.250000      13.000000       6.000000       1.000000
50%    414631.500000      26.000000      14.000000       1.000000
75%    621946.750000      38.000000      24.000000       1.000000
max    829262.000000      50.000000      35.000000      30.000000

In [34]:
# Check if all dates in calendar are sequential (no gaps)
calendar['Date'] = pd.to_datetime(calendar['Date'])
dates_sorted = calendar['Date'].sort_values().reset_index(drop=True)

# Check for gaps
is_sequential = (dates_sorted.diff() == pd.Timedelta(days=1)).all()
gaps = dates_sorted[dates_sorted.diff() > pd.Timedelta(days=1)]



# Check completo: orden, unicidad y secuencialidad
print("=== VERIFICACIÓN CALENDAR ===")
print(f"Rango: {dates_sorted.min()} → {dates_sorted.max()}")
print(f"Días esperados: {(dates_sorted.max() - dates_sorted.min()).days + 1}")
print(f"Días reales: {len(dates_sorted)}")
print(f"¿Ordenado? {(calendar['Date'] == dates_sorted).all()}")
print(f"¿Únicos? {calendar['Date'].is_unique}")
print(f"¿Son secuenciales? {is_sequential}")
print(f"Número de gaps: {len(gaps)}")
if len(gaps) > 1:
    print("Fechas con gaps:\n", gaps)

=== VERIFICACIÓN CALENDAR ===
Rango: 2022-01-01 00:00:00 → 2023-09-30 00:00:00
Días esperados: 638
Días reales: 638
¿Ordenado? True
¿Únicos? True
¿Son secuenciales? False
Número de gaps: 0